# Analysis of World University Rankings by CUWR

## Table of Contents
### 1- Import Libraries
### 2- Import Data
### 3- Data wrangling (dropping columns, pending feedback from CUWR)
### 4- Checking for missing data and duplicates

# Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Importing Data

In [6]:
df_rankings = pd.read_csv(r'/Users/nayeraibrahim/Documents/CF assignments/Own Project/cwurData 2013-2015.csv', index_col = False)

In [10]:
df_rankings.shape

(2100, 14)

In [4]:
df_rankings.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,1,1,1,1,1,1,NaN,7,100.00,2013
1,2,Stanford University,USA,2,11,2,4,6,2,2,NaN,11,93.94,2013
2,3,University of Oxford,United Kingdom,1,7,12,10,11,7,13,NaN,15,92.54,2013
3,4,Massachusetts Institute of Technology,USA,3,2,16,2,16,3,3,NaN,1,91.45,2013
4,5,University of Cambridge,United Kingdom,2,3,15,5,9,11,10,NaN,39,90.24,2013

In [ ]:
#Checking data types

In [8]:
df_rankings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2100 entries, 0 to 2099
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2100 non-null   int64
 1   institution           2100 non-null   object
 2   country               2100 non-null   object
 3   national_rank         2100 non-null   int64
 4   quality_of_education  2100 non-null   int64
 5   alumni_employment     2100 non-null   int64
 6   quality_of_faculty    2100 non-null   int64
 7   publications          2100 non-null   int64
 8   influence             2100 non-null   int64
 9   citations             2100 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2100 non-null   int64
 12  score                 2100 non-null   float64
 13  year                  2100 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 229.8+ KB

In [ ]:
## Data types seem to be all correct.

In [12]:
# Data description
df_rankings.describe()

,world_rank,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
count,2100.000000,2100.000000,2100.000000,2100.000000,2100.000000,2100.000000,2100.000000,2100.000000,2000.000000,2100.000000,2100.000000,2100.000000
mean,479.071429,41.332381,285.037619,370.532381,184.695714,479.189048,479.079048,430.512381,496.699500,450.950952,47.458276,2014.428571
std,297.708846,52.572960,115.527401,180.380104,59.151200,297.374038,296.914598,258.331048,286.919755,267.886055,7.283028,0.583351
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,44.020000,2013.000000
25%,213.000000,6.000000,213.000000,213.000000,210.000000,213.000000,213.000000,200.000000,250.500000,204.000000,44.450000,2014.000000
50%,475.500000,22.000000,355.000000,475.500000,210.000000,475.000000,475.500000,428.000000,496.000000,470.500000,45.020000,2014.000000
75%,738.000000,50.000000,367.000000,478.000000,218.000000,738.000000,738.000000,645.000000,741.000000,737.000000,47.160000,2015.000000
max,1000.000000,229.000000,367.000000,567.000000,218.000000,1000.000000,991.000000,812.000000,1000.000000,871.000000,100.000000,2015.000000

In [ ]:
## It is clear that broad_impact column is missing a 100 values

In [17]:
# Counting rows for each ranking year
df_rankings['year'].value_counts()[2013]

100

In [18]:
df_rankings['year'].value_counts()[2014]

1000

In [19]:
df_rankings['year'].value_counts()[2015]

1000

# Data wrangling (dropping columns)

# Checking for missing data and duplicates

In [13]:
#checking for missing data
df_rankings.isnull().sum()

world_rank                0
institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            100
patents                   0
score                     0
year                      0
dtype: int64

In [14]:
#checking for duplicate data
df_rankings_dups = df_rankings[df_rankings.duplicated()]

In [20]:
df_rankings_dups.head()

Empty DataFrame
Columns: [world_rank, institution, country, national_rank, quality_of_education, alumni_employment, quality_of_faculty, publications, influence, citations, broad_impact, patents, score, year]
Index: []

In [ ]:
## No duplicate values were found

In [22]:
#Columns "patents" and "broad_impact" will be dropped
df_rankings_drpcol = df_rankings.drop(columns = ['patents','broad_impact'])
df_rankings_drpcol.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,score,year
0,1,Harvard University,USA,1,1,1,1,1,1,1,100.00,2013
1,2,Stanford University,USA,2,11,2,4,6,2,2,93.94,2013
2,3,University of Oxford,United Kingdom,1,7,12,10,11,7,13,92.54,2013
3,4,Massachusetts Institute of Technology,USA,3,2,16,2,16,3,3,91.45,2013
4,5,University of Cambridge,United Kingdom,2,3,15,5,9,11,10,90.24,2013

In [25]:
#Export data
df_rankings_drpcol.to_csv(r'/Users/nayeraibrahim/Documents/CF assignments/Own Project/rankings_columnsdropped.csv')